src/cf/src/Documents/ТабельУчётаРабочегоВремени/ТабельУчётаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТабельУчётаРабочегоВремени</name>
  <registerRecords>InformationRegister.ОтработанноеВремяСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТабель</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботыСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>_1</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_1_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_2</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_2_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_3</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_3_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_4</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_4_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_5</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_5_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_6</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_6_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_7</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_7_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_8</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_8_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_9</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_9_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_10</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_10_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_11</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_11_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_12</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_12_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_13</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_13_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_14</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_14_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_15</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_15_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_16</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_16_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_17</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_17_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_18</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_18_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_19</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_19_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_20</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_20_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_21</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_21_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_22</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_22_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_23</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_23_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_24</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_24_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_25</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_25_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_26</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_26_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_27</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_27_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_28</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_28_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_29</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_29_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_30</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_30_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_31</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_31_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоГрафику</name>
      <type>
        <types>DefinedType.ОтработанноеВремя</types>
      </type>
    </attributes>
    <attributes>
      <name>Отработано</name>
      <type>
        <types>DefinedType.ОтработанноеВремя</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоГрафикуДней</name>
      <type>
        <types>DefinedType.ОтработанноеВремя</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>DefinedType.ОтработанноеВремя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ТабельУчётаРабочегоВремени/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Печать табеля учёта рабочего времени: перенесена из модуля команды в подсистему
// печатных форм (конвенция ДобавитьКомандыПечати/Печать).
//
// В названиях реквизитов и в тексте печатной формы используется буква "ё",
// как принято в метаданных maERP.
// BSLLS:YoLetterUsage-off
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы документа.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "Табель";
	Команда.Представление = НСтр("ru = 'Табель учёта рабочего времени'; fr = 'Feuille de temps';
		|en = 'Timesheet'; es = 'Hoja de horas'");

КонецПроцедуры

// Формирует запрошенные печатные формы документа.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые документы
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие документов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если Не ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "Табель") Тогда
		Возврат;
	КонецЕсли;

	Таб = Новый ТабличныйДокумент;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Таб.АвтоМасштаб = Истина;
	Для Каждого Док Из МассивОбъектов Цикл
		НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
		ПечатьТабеля(Док, Таб);
		ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
	КонецЦикла;

	ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "Табель",
		НСтр("ru = 'Табель учёта рабочего времени'; fr = 'Feuille de temps';
			|en = 'Timesheet'; es = 'Hoja de horas'"),
		Таб, "Документ.ТабельУчётаРабочегоВремени.Табель");

КонецПроцедуры

// Выводит табель одного документа в табличный документ.
//
// Параметры:
//  Док - ДокументСсылка.ТабельУчётаРабочегоВремени - печатаемый документ
//  Таб - ТабличныйДокумент                        - документ вывода
//
Процедура ПечатьТабеля(Док, Таб) Экспорт
	КоличествоДнейВМесяце = День(КонецМесяца(Док.Дата));
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.ТабельУчётаРабочегоВремени.Табель");
	оШапкаОсновная = Макет.ПолучитьОбласть("Шапка|Основная");
	оШапкаДата = Макет.ПолучитьОбласть("Шапка|Дата");
	оСтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
	оСтрокаДата = Макет.ПолучитьОбласть("Строка|Дата");
	оШапкаОсновная.Параметры.Номер = Док.Номер;
	оШапкаОсновная.Параметры.Период = Формат(Док.Дата, "ДФ='MMMM yyyy'");
	// Параметр «Группа» в макете есть, а реквизита у документа нет - наследие drissotex,
	// см. docs/TECHDEBT.md. Оставляем незаполненным: печать не должна падать из-за подписи.
	Таб.Вывести(оШапкаОсновная);	
	мДата = НачалоМесяца(Док.Дата);
	Для А = 1 По КоличествоДнейВМесяце Цикл
		НомерДня = День(мДата);
		НомерДняНедели = ДеньНедели(мДата);		
		оШапкаДата.Параметры.Дата = СокрЛП(НомерДня) + " (" + ПолучитьДеньНеделиПоНомеру(НомерДняНедели) + ")";
		Таб.Присоединить(оШапкаДата);
		мДата = КонецДня(мДата) + 1;
	КонецЦикла;	
	Ном = 1;
	Для Каждого Стр Из Док.ТЧТабель Цикл
		оСтрокаОсновная.Параметры.Ном = Ном;
		оСтрокаОсновная.Параметры.Сотрудник = Стр.Сотрудник;
		// Реквизита «ВариантУчётаРабочегоВремени» у строки табеля нет: учёт задаёт график
		// работы сотрудника, его и печатаем (docs/TECHDEBT.md).
		оСтрокаОсновная.Параметры.ВариантУчётаРабочегоВремени = Стр.ГрафикРаботы;
		оСтрокаОсновная.Параметры.ПоГрафику = Стр.ПоГрафику;
		оСтрокаОсновная.Параметры.Отработано = Стр.Отработано;
		Таб.Вывести(оСтрокаОсновная);
		Для А = 1 По КоличествоДнейВМесяце Цикл
			Если ЗначениеЗаполнено(Стр["_" + А]) И Стр["_" + А] <> Ложь Тогда
				оСтрокаДата.Параметры.Выход = Стр["_" + А];
				оСтрокаДата.Области.Выход.ЦветФона = ЦветаСтиля.ЦветФонаГруппировкиОтчета2;
			Иначе	
				оСтрокаДата.Параметры.Выход = "";
				оСтрокаДата.Области.Выход.ЦветФона = WebЦвета.Белый;
			КонецЕсли;			
			Таб.Присоединить(оСтрокаДата);	
		КонецЦикла;	
		Ном = Ном + 1;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Русское сокращение дня недели по его номеру.
//
// Параметры:
//  Номер - Число - номер дня недели, 1 - понедельник
//
// Возвращаемое значение:
//  Строка - сокращение дня недели
//
Функция ПолучитьДеньНеделиПоНомеру(Номер)

	Сокращения = СтрРазделить(НСтр("ru = 'пн.,вт.,ср.,чт.,пт.,сб.,вс.';
		|fr = 'lun.,mar.,mer.,jeu.,ven.,sam.,dim.';
		|en = 'Mon,Tue,Wed,Thu,Fri,Sat,Sun';
		|es = 'lun.,mar.,mié.,jue.,vie.,sáb.,dom.'"), ",");

	Если Номер < 1 Или Номер > Сокращения.Количество() Тогда
		Возврат "";
	КонецЕсли;

	Возврат Сокращения[Номер - 1];

КонецФункции

#КонецОбласти
